import { HelpMessageFormat } from '../../base/pages/HelpMessageFormat';

export const HelpTranslation: HelpMessageFormat = {
    hero: {
        title: 'Справка',
        subtitle: 'Частые проблемы и возможные решения'
    },
    tabs: {
        general: 'Общее',
        gameWontStart: 'Игра не запускается',
        modsNotShowing: 'Моды не отображаются',
        updating: 'Обновление',
    },
    general: {
        gettingStarted: {
            title: 'Начните с установки модов',
            whereToFindMods: `
            Перейдите на вкладку «{''}@:translations.pages.manager.navigation.modsActions.online{''}», найдите мод и нажмите «Скачать».
            Зависимости скачаются автоматически, что сэкономит ваше время.
            `,
            onceInstalled: 'После установки нужных модов просто нажмите {startModdedAction} в левом верхнем углу.',
        },
        slowGame: {
            title: 'Игра тормозит с модами / фризы?',
            likelyCause: `
            Вероятно, один из модов выдаёт ошибки.
            Одно из решений — отключить половину модов и проверить, осталась ли проблема.
            `,
            issuePersisting: `
            Если проблема сохраняется, отключите ещё половину.
            Повторяйте, пока проблема не исчезнет.
            `,
            ifStutters: 'Если дело в фризах, возможно, помогут моды на оптимизацию.',
        },
        dedicatedServers: {
            title: 'Выделенные серверы',
            content: `
            Выделенные серверы не поддерживаются менеджером напрямую, но можно
            скопировать содержимое папки профиля в папку выделенного сервера.
            `,
        },
        launchingExternally: {
            title: 'Запуск игры вне менеджера модов',
            howTo: 'По задумке при запуске игры через Steam вы получите ванильную (без модов) версию.',
            whereToPlace: 'Нужно указать соответствующий аргумент в поле параметров запуска вашей платформы.',
            forSteam: 'В Steam это находится в свойствах игры.',
            yourCurrentArgument: 'Ваш текущий аргумент:',
            loaderNotInstalled: 'Эти параметры станут доступны после установки загрузчика модов.',
            copyArguments: 'Скопировать параметры запуска',
        },
    },
    gameWontStart: {
        errorModal: {
            title: 'При запуске игры появляется красное окно',
            solution: 'Обычно внизу красного окна есть подсказка. Возможно, она поможет решить проблему.',
        },
        redirectedToStorePage: {
            title: 'Меня перенаправляет на страницу магазина Steam',
            solution: 'Для использования {appName} нужна легальная копия игры. Её можно купить на странице магазина.',
        },
        consoleCloses: {
            title: 'Появляется текстовое окно и сразу закрывается',
            tryRunning: 'Попробуйте выполнить «Сбросить установку {gameName}» на экране настроек.', // TODO - Reference translation via Settings screen
            ifPersists: 'Если не помогло, принудительно закройте Steam и запустите игру с модами при закрытом Steam.',
        }
    },
    modsNotShowing: {
        potentialSolutions: {
            title: 'Возможные решения',
            instructToWiki: 'Большинство частых проблем решается точным выполнением инструкций из вики.',
            goToWiki: 'Перейти в вики',
        }
    },
    updating: {
        autoUpdates: {
            title: 'Автоматические обновления',
            whenDoesItUpdate: 'Если доступно обновление, менеджер обновляется автоматически при закрытии.',
            downloadedInBackground: 'Обновления скачиваются в фоне.',
            promptToRunOldInstaller: 'Может появиться запрос на запуск «{oldInstaller}» от имени администратора. Это программа обновления.',
            ifProblemOccurs: 'Если при обновлении возникла проблема, скачайте и запустите последний установщик.',
        },
        ignoreUpdates: {
            title: 'Я не хочу обновлений',
            content: 'На GitHub есть портативная версия без автообновления. Но при наличии обновления она всё равно сообщит об этом.'
        }
    }
}
